music_App_project/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2023-06-13 20:36:52.552871"], ["id", 2]]
---
    def reset_session_token!
        self.session_token=self.generate_unique_session_token
           self.save!